gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/source/freertos_event.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"
#include "event_groups.h"
#include "semphr.h"
#include "fsl_pint.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "app.h"
#include "pmic_support.h"
#include "pmic_pca9422.h"
#include "glf70583.h"
#include "aw933xx.h"
#include "aw93305.h"
#include "bq256xx_charger.h"
#include "glf70302.h"
#include "ktd202x_leds.h"
#include "aw88166.h"

#include "fsl_dma.h"
#include "fsl_i2s.h"
#include "fsl_i2s_dma.h"
#include "music.h"

#include "spi_handler.h"
#include "led_status.h"

#include <string.h>
#include <stdlib.h>

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define USE_EVENT 1
#define USE_SEMAPHORE 0

#define SCAN_I2C_ADDRESS_ENABLE 1

/* pca9422 ship mode  */
#define LONG_PRESS_MS    (2000U)  // 必須持續 2 秒
#define SAMPLE_MS        (10U)    // 輪詢間隔 10ms，兼具簡單防抖

/* event bits */
#define BTN_NOTIFY_EDGE   (1UL << 0)  // 在sButtonTaskHandle，來自 FunKey PINT ISR 的雙邊緣事件，
#define BTN_NOTIFY_DBL    (1UL << 1)  // 在sButtonTaskHandle，雙擊計時器到時，
#define PWR_NOTIFY_EDGE   (1UL << 0)  // 在sPowerKeyTaskHandle，來自 PowerKey PINT ISR 的邊緣事件

/* === 按鍵行為參數 === */
#define BTN_ACTIVE_LEVEL          0   // active-low: 按下=0，放開=1；若相反改為 1
#define BTN_DEBOUNCE_MS          30
#define BTN_LONG_MS            1000
#define BTN_DBLCLICK_GAP_MS     300
#define PWR_ACTIVE_LEVEL          0      // active-low: 按下=0；若為 active-high 改為 1
#define PWR_DEBOUNCE_MS          30      // 軟體去抖
#define PWR_LONG_MS            3000      // 長按 3 秒（放開才判斷）
#define PWR_MIN_SHORT_MS         50      // 太短的抖動/誤觸（<50ms）不算短按
#define POWER_KEY_PINT_CH  		  0   // PINT 通道
#define FUN_KEY1_PINT_CH  		  1   // PINT 通道
/* === 按鈕任務的 handle 與軟體定時器 === */
static TaskHandle_t   sButtonTaskHandle = NULL;
static TimerHandle_t  sBtnDblTimer  = NULL;
static TaskHandle_t sPowerKeyTaskHandle = NULL;

/*****************************************************************************************************/
/* ===== I2C EventGroup bits (for unified I2C_Task) ===== */
#define TOUCH_EVENT_BIT      (1UL << 0)
#define CHARGER_EVENT_BIT    (1UL << 1)
#define GAUGE_EVENT_BIT      (1UL << 2)
#define LED_EVENT_BIT        (1UL << 3)   /* LED task wake-up flag */
#define AMP_EVENT_BIT     	 (1UL << 4)

BatteryInfo battery;
/* ===== I2C synchronization objects ===== */
static EventGroupHandle_t i2c_event_group = NULL;
static SemaphoreHandle_t  i2c_mutex       = NULL;
static TaskHandle_t       sI2CTaskHandle  = NULL;

/* ===== I2C task prototype & external device handlers ===== */
static void I2C_Task(void *pvParameters);

extern volatile struct aw933xx_dev aw933xx;

/*====== I2S prototype======*/
static dma_handle_t s_DmaTxHandle;
static i2s_config_t s_TxConfig;
static i2s_dma_handle_t s_TxHandle;
static i2s_transfer_t s_TxTransfer;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void button_task(void *pvParameters);

/* ===== external SPI handlers ===== */
extern QueueHandle_t spi_request_queue ;
extern EventGroupHandle_t spi_event_group ;
extern SemaphoreHandle_t spi_semaphore ;

/*===== LED handlers =====*/
TaskHandle_t sLEDTaskHandle;
volatile led_event_t g_led_event = LED_EVT_NONE;

uint8_t reg_led =0;

/*===== AMP handlers ===== */
typedef enum {
    AMP_EVT_NONE = 0,
    AMP_EVT_MUSIC_START,
	AMP_EVT_RECEIVER_START,
    AMP_EVT_STOP,
} amp_event_t;

typedef enum {
    AMP_MODE_MUSIC = 0,
    AMP_MODE_RECEIVER = 1,
} amp_mode_t;


volatile amp_event_t g_amp_event = AMP_EVT_NONE;

/*******************************************************************************
 * Code
 ******************************************************************************/
static void pca9422_ship_mode(void)
{
	PRINTF("[PCA9422] PCA9422 enter ship mode \r\n");
	/* pca9422 ship mode process */
	uint8_t value;
    value = 0x10;
    BOARD_PMIC_I2C_Send(PCA9422_DEFAULT_I2C_ADDR, 0x09, 1, &value, 1);
    value = 0x00;
    BOARD_PMIC_I2C_Send(PCA9422_DEFAULT_I2C_ADDR, 0x0A, 1, &value, 1);
}
static void pca9422_power_down(void)
{
    PRINTF("[PCA9422] PCA9422 power down \r\n");
	/* pca9422 power down  process */
    uint8_t value;
    value = 0x08;
    BOARD_PMIC_I2C_Send(PCA9422_DEFAULT_I2C_ADDR, 0x09, 1, &value, 1);
    value = 0x00;
    BOARD_PMIC_I2C_Send(PCA9422_DEFAULT_I2C_ADDR, 0x0A, 1, &value, 1);
}

/* 簡單阻塞式 delay：使用 NXP SDK，依核心時脈做最少延遲 */
static inline void delay_ms(uint32_t ms)
{
    SDK_DelayAtLeastUs(ms * 1000U, CLOCK_GetFreq(kCLOCK_CoreSysClk));
}

/* 檢查按鍵是否連續維持低電位（active-low）達指定毫秒數 */
static bool power_key_low_for_ms(uint32_t ms) //for pca9422 ship mode
{
    uint32_t elapsed = 0U;

    while (elapsed < ms)
    {
        /* 低電位＝按下（active-low 假設） */
        if (GPIO_PinRead(GPIO, POWER_KEY_PORT, POWER_KEY_PIN) != 0U)
        {
            return false;  // 中途釋放，長按失敗
        }
        delay_ms(SAMPLE_MS);
        elapsed += SAMPLE_MS;
    }
    return true; // 全程保持低電位達指定時間
}

static void TxCallback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData)
{
    /* Enqueue the same original buffer all over again */
    i2s_transfer_t *transfer = (i2s_transfer_t *)userData;
    I2S_TxTransferSendDMA(base, handle, *transfer);
}
static void StopSoundPlayback(void)
{
    PRINTF("[I2S1]Stopping sound playback\r\n");

    close_aw88166_pa(AW_DEV_0);
    close_aw88166_pa(AW_DEV_1);

    I2S_TransferAbortDMA(DEMO_I2S_TX_toAmp, &s_TxHandle);
}

static void StartSoundPlayback(amp_mode_t mode)
{
    const char *profile = (mode == AMP_MODE_RECEIVER) ? "Receiver" : "Music";

    PRINTF("[I2S1]Setup looping playback of sine wave (%s mode)\r\n", profile);

    s_TxTransfer.data     = &g_Music[0];
    s_TxTransfer.dataSize = sizeof(g_Music);

    I2S_TxTransferCreateHandleDMA(DEMO_I2S_TX_toAmp,  &s_TxHandle, &s_DmaTxHandle, TxCallback, (void *)&s_TxTransfer);
    I2S_TxTransferSendDMA(DEMO_I2S_TX_toAmp,  &s_TxHandle, s_TxTransfer);

    start_aw88166_pa(AW_DEV_0, profile);
    start_aw88166_pa(AW_DEV_1, profile);
}

static void amp_post_event(amp_event_t e)
{
    g_amp_event = e;
    if (i2c_event_group) {
        xEventGroupSetBits(i2c_event_group, AMP_EVENT_BIT);
    }
}


void led_post_event(led_event_t e)
{
    g_led_event = e;
    if (i2c_event_group) {
        xEventGroupSetBits(i2c_event_group, LED_EVENT_BIT);

